 IDENTIFICATION DIVISION.
 PROGRAM-ID. SumaDigitos.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 NUM PIC 9(10) VALUE 0.
 01 SUMA PIC 9(10) VALUE 0.
 01 DIGITO PIC 9 VALUE 0.
 PROCEDURE DIVISION.
   DISPLAY "Ingrese un número: ".
   ACCEPT NUM.
   PERFORM CALCULAR-SUMA
   DISPLAY "La suma de los dígitos es: " SUMA.
   STOP RUN.
 CALCULAR-SUMA.
   PERFORM UNTIL NUM = 0
       COMPUTE DIGITO = NUM MOD 10
       ADD DIGITO TO SUMA
       DIVIDE NUM BY 10 GIVING NUM
   END-PERFORM.
   EXIT.
