 IDENTIFICATION DIVISION.
 PROGRAM-ID. TextoMayusculas.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 TEXTO PIC X(50) VALUE SPACES.
 01 TEXTO-MAYUS PIC X(50) VALUE SPACES.
 01 INDICE PIC 9(2) VALUE 1.
 PROCEDURE DIVISION.
 DISPLAY "Ingrese un texto: ".
 ACCEPT TEXTO.
 PERFORM CONVERTIR-MAYUS
 DISPLAY "Texto en mayúsculas: " TEXTO-MAYUS.
 STOP RUN.
 CONVERTIR-MAYUS.
 PERFORM VARYING INDICE FROM 1 BY 1 UNTIL INDICE > LENGTH OF TEXTO
 IF TEXTO(INDICE:1) >= 'a' AND TEXTO(INDICE:1) <= 'z' THEN
 COMPUTE TEXTO-MAYUS(INDICE:1) = FUNCTION NUMVALC(TEXTO(INDICE:1)) - 32
 ELSE
 MOVE TEXTO(INDICE:1) TO TEXTO-MAYUS(INDICE:1)
 END-IF
 END-PERFORM.
 EXIT.
