 IDENTIFICATION DIVISION.
 PROGRAM-ID. NumeroPrimo.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 NUM PIC 9(4) VALUE 0.
 01 ES-PRIMO PIC X VALUE 'S'.
 01 I PIC 9(4) VALUE 2.
 PROCEDURE DIVISION.
 DISPLAY "Ingrese un número: ".
 ACCEPT NUM.
 PERFORM VERIFICAR-PRIMO
 IF ES-PRIMO = 'S' THEN
 DISPLAY "El número " NUM " es primo."
 ELSE
 DISPLAY "El número " NUM " no es primo."
 END-IF.
 STOP RUN.
 VERIFICAR-PRIMO.
 IF NUM < 2 THEN
 MOVE 'N' TO ES-PRIMO
 EXIT PERFORM
 END-IF.
 PERFORM VARYING I FROM 2 BY 1 UNTIL I > NUM / 2
 IF NUM MOD I = 0 THEN
 MOVE 'N' TO ES-PRIMO
 EXIT PERFORM
 END-IF
 END-PERFORM.
 EXIT.
