 IDENTIFICATION DIVISION.
 PROGRAM-ID. ParImpar.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 NUM PIC 9(4) VALUE 0.
 01 RESULTADO PIC X(10).
 PROCEDURE DIVISION.
 DISPLAY "Ingrese un número: ".
 ACCEPT NUM.
 IF NUM MOD 2 = 0 THEN
 MOVE "Par" TO RESULTADO
 ELSE
 MOVE "Impar" TO RESULTADO
 END-IF.
 DISPLAY "El número es: " RESULTADO.
 STOP RUN.
