 IDENTIFICATION DIVISION.
 PROGRAM-ID. CelsiusAFahrenheit.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 CELSIUS PIC 9(3)V9(1) VALUE 0.
 01 FAHRENHEIT PIC 9(3)V9(1) VALUE 0.
 PROCEDURE DIVISION.
 DISPLAY "Ingrese la temperatura en grados Celsius: ".
 ACCEPT CELSIUS.
 COMPUTE FAHRENHEIT = (9 / 5.0 * CELSIUS) + 32.
 DISPLAY "La temperatura en Fahrenheit es: " FAHRENHEIT.
 STOP RUN.
