 IDENTIFICATION DIVISION.
 PROGRAM-ID. PromedioTresNumeros.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 NUM1 PIC 9(4) VALUE 0.
 01 NUM2 PIC 9(4) VALUE 0.
 01 NUM3 PIC 9(4) VALUE 0.
 01 PROMEDIO PIC 9(4)V9(2) VALUE 0.
 PROCEDURE DIVISION.
 DISPLAY "Ingrese el primer número: ".
 ACCEPT NUM1.
 DISPLAY "Ingrese el segundo número: ".
 ACCEPT NUM2.
 DISPLAY "Ingrese el tercer número: ".
 ACCEPT NUM3.
 COMPUTE PROMEDIO = (NUM1 + NUM2 + NUM3) / 3.
 DISPLAY "El promedio es: " PROMEDIO.
 STOP RUN.
