 IDENTIFICATION DIVISION.
 PROGRAM-ID. Factorial.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 NUM PIC 9(2) VALUE 0.
 01 FACTORIAL PIC 9(9) VALUE 1.
 01 I PIC 9(2) VALUE 1.
 PROCEDURE DIVISION.
 DISPLAY "Ingrese un número: ".
 ACCEPT NUM.
 PERFORM CALCULAR-FACTORIAL
 DISPLAY "El factorial de " NUM " es " FACTORIAL.
 STOP RUN.
 CALCULAR-FACTORIAL.
 PERFORM VARYING I FROM 1 BY 1 UNTIL I > NUM
 MULTIPLY I BY FACTORIAL GIVING FACTORIAL
 END-PERFORM.
 EXIT.
