 IDENTIFICATION DIVISION.
 PROGRAM-ID. ListaNumeros.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 CONTADOR PIC 9(2) VALUE 1.
 PROCEDURE DIVISION.
   PERFORM UNTIL CONTADOR > 10
      DISPLAY CONTADOR
      ADD 1 TO CONTADOR
   END-PERFORM.
   STOP RUN.
