IDENTIFICATION DIVISION.
         PROGRAM-ID. SumarNumeros.

         DATA DIVISION.
         WORKING-STORAGE SECTION.
          01 WS-RESULTADO PIC 9(4).

         LINKAGE SECTION.
           01 LK-NUM1 PIC 9(4).
           01 LK-NUM2 PIC 9(4).
           01 LK-RESUL PIC 9(4).

         PROCEDURE DIVISION USING LK-NUM1 LK-NUM2 LK-RESUL.
           ADD LK-NUM1 TO LK-NUM2 GIVING WS-RESULTADO.
           MOVE WS-RESULTADO TO LK-RESUL.
           EXIT PROGRAM.
